fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// +++ ВКМ Телицин С.Л. (Договоры на абонентское обслуживание)
	ДобавитьГруппаЭлементовАбонентскоеОбслуживание();
	// --- ВКМ Телицин С.Л. (Договоры на абонентское обслуживание)
КонецПроцедуры

&НаКлиенте
	Процедура ПриОткрытии(Отказ)
	// +++ ВКМ Телицин С.Л. (Договоры на абонентское обслуживание)
	ВидимостьДополнительныхРеквизитов();
	// --- ВКМ Телицин С.Л. (Договоры на абонентское обслуживание)
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	// +++ ВКМ Телицин С.Л. (Договоры на абонентское обслуживание)
	ВидимостьДополнительныхРеквизитов();
	// --- ВКМ Телицин С.Л. (Договоры на абонентское обслуживание)
КонецПроцедуры
#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьГруппаЭлементовАбонентскоеОбслуживание()
	
	// +++ ВКМ Телицин С.Л. (Договоры на абонентское обслуживание)
	
	//Создаем группу формы
	ГруппаАбонентскоеОбслуживание = Элементы.Добавить("ГруппаАбонентскоеОбслуживание", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаАбонентскоеОбслуживание.Вид				  = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАбонентскоеОбслуживание.ОтображатьЗаголовок = Ложь;
	ГруппаАбонентскоеОбслуживание.Группировка		  = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	// Создаем элементы формы ДатаНачала
	ПолеДатаНачала = Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"), ГруппаАбонентскоеОбслуживание);
	ПолеДатаНачала.Вид					= ВидПоляФормы.ПолеВвода;
	ПолеДатаНачала.ПутьКДанным			= "Объект.ВКМ_ДатаНачала";
	
	// Создаем элементы формы ДатаОкончания
	ПолеДатаОкончания = Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"), ГруппаАбонентскоеОбслуживание);
	ПолеДатаОкончания.Вид				 = ВидПоляФормы.ПолеВвода;
	ПолеДатаОкончания.ПутьКДанным		 = "Объект.ВКМ_ДатаОкончания";
	
	// Создаем элементы формы ПолеСуммаАбонентскойПлаты
	ПолеСуммаАбонентскойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ГруппаАбонентскоеОбслуживание);
	ПолеСуммаАбонентскойПлаты.Вид		 = ВидПоляФормы.ПолеВвода;
	ПолеСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	// Создаем элементы формы СтоимостьЧаса
	ПолеСтоимостьЧаса = Элементы.Добавить("ВКМ_СтимостьЧаса", Тип("ПолеФормы"), ГруппаАбонентскоеОбслуживание);
	ПолеСтоимостьЧаса.Вид				 = ВидПоляФормы.ПолеВвода;
	ПолеСтоимостьЧаса.ПутьКДанным		 = "Объект.ВКМ_СтимостьЧаса";
	// --- ВКМ Телицин С.Л. (Договоры на абонентское обслуживание)
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьДополнительныхРеквизитов()
	
	// +++ ВКМ Телицин С.Л. (Договоры на абонентское обслуживание)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		Элементы.ГруппаАбонентскоеОбслуживание.Видимость = Истина;
	Иначе
		Элементы.ГруппаАбонентскоеОбслуживание.Видимость = Ложь;
	КонецЕсли;
	// --- ВКМ Телицин С.Л. (Договоры на абонентское обслуживание)
	
КонецПроцедуры

#КонецОбласти
